> mf=function(x=1){x=x+2;return(x)}
> mf(3)
[1] 5
> mf
function(x=1){x=x+2;return(x)}
> mf=function(x=1){x=x+2;
+ x=x+3;
+ }
> mf
function(x=1){x=x+2;
x=x+3;
}
> mf()
> y=mf()
> y
[1] 6
> getwd()
[1] "C:/Users/Tihomir/Documents"
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> setwd('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19')
> m2(3)
[1] 9
> m2()
[1] 3
> ?for
+     
+ }
Error: unexpected '}' in:
"    
}"
> ?for
+     
+ }
Error: unexpected '}' in:
"    
}"
> for
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> m(1,2,10)
Error in m(1, 2, 10) : could not find function "m"
> dfunk1(1,2,10)
 [1]  1  2  6  4  5  6  7  8  9 10 11
> 3:5+1
[1] 4 5 6
> 3:(5+1)
[1] 3 4 5 6
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> dfunk1(1,2,20)
 [1]         1         2         6        16        44       120       328       896      2448      6688     18272     49920
[13]    136384    372608   1017984   2781184   7598336  20759040  56714752 154947584 423324672
> dfunk1(1,2,4)
[1]  1  2  6 16 44
> x=dfunk1(1,2,20)
> x[21]
[1] 423324672
> sum(x)
[1] 667731285
?while
+     
+ }
Error: unexpected '}' in:
"    
}"
>     
> }
Error: unexpected '}' in "}"
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> dfunk2(1/2)
[1] 0.4927028
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> dfunk2(1/2)
[1] 23
> dfunk2(0.999)
[1] 70
> dfunk2(0.99)
[1] 57
> dfunk2(0.15)
[1] 12
> ?sample
> sample(1:6,6,replace=T)
[1] 1 3 1 3 3 3
> sample(1:6,6,replace=T)
[1] 3 2 6 1 3 3
> sample(1:6,6,replace=T)
[1] 4 5 4 4 4 4
> sample(1:6,6,replace=T)
[1] 3 5 4 2 3 5
> sample(1:6,6,replace=T)
[1] 6 1 5 4 1 4
> sample(1:6,6,replace=T)
[1] 4 4 3 3 5 5
> sample(1:6,6,replace=T,prob=c(0.1,0.1,0.1,0.1,0.1,0.5))
[1] 1 2 6 5 6 3
> sample(1:6,6,replace=F,prob=c(0.1,0.1,0.1,0.1,0.1,0.5))
[1] 6 4 3 2 1 5
> x=sample(1:6,6,replace=F,prob=c(0.1,0.1,0.1,0.1,0.1,0.5))
> sum(x==6)
[1] 1
> rep(5,3)
[1] 5 5 5
> zar()
Error in zar() : could not find function "zar"
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> zar
function(k=100)
{
  x=sample(1:6,k,replace=T)
  return(sum(x==6))
}
> zar()
[1] 22
> zar()
[1] 16
> zar()
[1] 24
> zar(20)
[1] 3
> zar(20)
[1] 3
> zar(20)
[1] 1
> sum(sample(1:6,100,replace=T)==6)
[1] 21
> sum(sample(1:6,100,replace=T)==6)
[1] 11
> sum(sample(1:6,100,replace=T)==6)
[1] 12
> rep(0,10)
 [1] 0 0 0 0 0 0 0 0 0 0
> rep(1,10)
 [1] 1 1 1 1 1 1 1 1 1 1
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> 1:2/4:5
[1] 0.25 0.40
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> all(10)
Error in v[k] <- v[k - 1] + zar() : replacement has length zero
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> all(10)
 [1]  24  41  61  82  99 117 130 153 168 180
> 1:5*100
[1] 100 200 300 400 500
> source('D:/FMI/Bachelor/Informatics/Elective Courses/Софтуер за Научни Изчисления/2019 - R Studio/29.10.19/m2.R')
> all(10)
 [1] 0.1400000 0.1550000 0.1533333 0.1575000 0.1600000 0.1633333 0.1614286 0.1675000 0.1733333
[10] 0.1710000
> all(100)
  [1] 0.1400000 0.1500000 0.1533333 0.1625000 0.1620000 0.1583333 0.1642857 0.1612500
  [9] 0.1577778 0.1640000 0.1681818 0.1633333 0.1684615 0.1664286 0.1666667 0.1675000
 [17] 0.1664706 0.1666667 0.1700000 0.1680000 0.1652381 0.1659091 0.1634783 0.1641667
 [25] 0.1656000 0.1630769 0.1640741 0.1625000 0.1641379 0.1633333 0.1648387 0.1640625
 [33] 0.1633333 0.1626471 0.1614286 0.1605556 0.1602703 0.1602632 0.1602564 0.1602500
 [41] 0.1607317 0.1611905 0.1618605 0.1613636 0.1606667 0.1617391 0.1627660 0.1620833
 [49] 0.1626531 0.1630000 0.1627451 0.1630769 0.1620755 0.1616667 0.1605455 0.1610714
 [57] 0.1610526 0.1624138 0.1627119 0.1621667 0.1627869 0.1627419 0.1626984 0.1623438
 [65] 0.1613846 0.1607576 0.1608955 0.1616176 0.1610145 0.1610000 0.1607042 0.1612500
 [73] 0.1619178 0.1610811 0.1605333 0.1617105 0.1622078 0.1626923 0.1624051 0.1626250
 [81] 0.1634568 0.1631707 0.1630120 0.1639286 0.1638824 0.1645349 0.1645977 0.1648864
 [89] 0.1643820 0.1646667 0.1643956 0.1643478 0.1645161 0.1648936 0.1642105 0.1638542
 [97] 0.1632990 0.1631633 0.1629293 0.1638000
> plot(v)
Error in plot(v) : object 'v' not found
> v=all()
> v[1:100]
  [1] 0.1400000 0.1800000 0.1900000 0.1900000 0.1800000 0.1750000 0.1714286 0.1687500
  [9] 0.1666667 0.1700000 0.1681818 0.1683333 0.1715385 0.1750000 0.1753333 0.1731250
 [17] 0.1741176 0.1733333 0.1752632 0.1750000 0.1728571 0.1731818 0.1721739 0.1733333
 [25] 0.1696000 0.1707692 0.1707407 0.1721429 0.1703448 0.1693333 0.1690323 0.1675000
 [33] 0.1666667 0.1664706 0.1680000 0.1694444 0.1705405 0.1694737 0.1684615 0.1690000
 [41] 0.1680488 0.1664286 0.1665116 0.1670455 0.1666667 0.1678261 0.1680851 0.1679167
 [49] 0.1679592 0.1670000 0.1672549 0.1669231 0.1667925 0.1670370 0.1674545 0.1671429
 [57] 0.1664912 0.1667241 0.1672881 0.1676667 0.1678689 0.1680645 0.1687302 0.1678125
 [65] 0.1683077 0.1692424 0.1689552 0.1692647 0.1689855 0.1691429 0.1685915 0.1683333
 [73] 0.1684932 0.1677027 0.1681333 0.1671053 0.1667532 0.1671795 0.1670886 0.1672500
 [81] 0.1670370 0.1664634 0.1663855 0.1660714 0.1662353 0.1667442 0.1671264 0.1670455
 [89] 0.1670787 0.1677778 0.1681319 0.1678261 0.1680645 0.1682979 0.1692632 0.1689583
 [97] 0.1688660 0.1692857 0.1692929 0.1689000
> plot(v)
> plot(v,type='l')
> abline(h=1/6)
> v=all()
> plot(v,type='l')
> abline(h=1/6)
> v=all()
> plot(v,type='l')
> abline(h=1/6)

//
//
//functions
m2=function(x=1)
{
  x=x*3
  return(x)
}

dfunk1=function(a0,a1,n)
{
  v=1:(n+1)
  v[1]=a0
  v[2]=a1
  
  for(k in 3:(n+1))
  {
    v[k]=2*(v[k-1]+v[k-2])
  }
  
  return(v)
}

dfunk2=function(p)
{
  r=1
  n=1
  
  while(r>=1-p)
  {
    r=r*(365-n)/365
    n=n+1
  }
  return(n)
}

zar=function(k=100)
{
  x=sample(1:6,k,replace=T)
  return(sum(x==6))
}

all=function(n=1000)
{
  v=rep(0,n)
  v[1]=zar()
  for(k in 2:n)
  {
    v[k]=v[k-1]+zar()
  }
  z=(1:n)*100
  return(v/z)
}

makeGame=function()
{
  x=sample(0:1,1,prob=c(0.6,0.4))
  y=sample(0:1,1,prob=c(0.7,0.3))
}
